tap "anomalyco/tap"
tap "dopplerhq/cli"
tap "felixkratz/formulae"
tap "gentleman-programming/tap"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "localstack/tap"
tap "mtg/essentia"
tap "ngrok/ngrok"
tap "supersonic-app/supersonic"
tap "nikitabobko/tap"
tap "th-ch/youtube-music"
brew "act"
brew "borders"
brew "libpng"
brew "atuin"
brew "libyaml"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "freetype"
brew "carapace"
brew "coreutils"
brew "curl"
brew "eigen"
brew "elixir"
brew "eza"
brew "fd"
brew "libsamplerate"
brew "ffmpeg"
brew "gcc"
brew "fftw"
brew "fish"
brew "fzf"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "go"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "k6"
brew "k9s"
brew "lazygit"
brew "libtensorflow"
brew "meilisearch"
brew "lf"
brew "mupdf"
brew "neovim"
brew "newrelic-cli"
brew "node"
brew "pkgconf"
brew "nodenv"
brew "nowplaying-cli"
brew "nx"
brew "oci-cli"
brew "ripgrep"
brew "opencode"
brew "pipx"
brew "poppler"
brew "postgresql@14", link: false
brew "postgresql@18", link: true
brew "powerlevel10k"
brew "pyenv"
brew "python@3.11"
brew "qpdf"
brew "sevenzip"
brew "sox"
brew "starship"
brew "stow"
brew "taglib"
brew "tmux"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "dopplerhq/cli/doppler"
brew "felixkratz/formulae/sketchybar"
brew "gentleman-programming/tap/engram"
brew "gentleman-programming/tap/gentle-ai"
brew "hashicorp/tap/terraform"
brew "localstack/tap/localstack-cli"
cask "aerospace"
cask "comfyui"
cask "font-hack-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "kitty"
cask "monitorcontrol"
cask "ngrok"
cask "supersonic-app/supersonic/supersonic"
vscode "4ops.terraform"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "compulim.vscode-ipaddress"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "mk12.better-git-line-blame"
vscode "ms-azuretools.vscode-containers"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "orta.vscode-jest"
vscode "prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "vivaxy.vscode-conventional-commits"
vscode "yoavbls.pretty-ts-errors"
go "github.com/air-verse/air"
go "github.com/bootdotdev/bootdev"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "github.com/luisfelipej/hellogo"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "hello-rocket"
cargo "obsidian-export"
