return {
  "folke/snacks.nvim",
  opts = {
    dashboard = {
      preset = {
        -- Aquí pones tu ASCII Art personalizado
        header = [[
█████ █████ ███████████  █████ ███████████   ████████ 
▒▒███ ▒▒███ ▒▒███▒▒▒▒▒███▒▒███ ▒▒███▒▒▒▒▒███ ███▒▒▒▒███
 ▒▒███ ███   ▒███    ▒███ ▒███  ▒███    ▒███▒▒▒    ▒███
  ▒▒█████    ▒██████████  ▒███  ▒██████████    ██████▒ 
   ███▒███   ▒███▒▒▒▒▒▒   ▒███  ▒███▒▒▒▒▒▒    ▒▒▒▒▒▒███
  ███ ▒▒███  ▒███         ▒███  ▒███         ███   ▒███
 █████ █████ █████        █████ █████       ▒▒████████ 
▒▒▒▒▒ ▒▒▒▒▒ ▒▒▒▒▒        ▒▒▒▒▒ ▒▒▒▒▒         ▒▒▒▒▒▒▒▒  
                                                       
                                                       
                                                       
 ]],
        -- Puedes desactivar secciones poniendo enabled = false
        -- o personalizar las teclas (keys)
      },
      formats = {
        key = function(item)
          return { { "[", hl = "special" }, { item.key, hl = "key" }, { "]", hl = "special" } }
        end,
      },
      sections = {
        { section = "header" },
        { section = "keys", gap = 1, padding = 1 },
        { section = "startup" },
      },
    },
  },
}
